{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "veTO4_6tQxFR"
   },
   "source": [
    "# Циклы. Практическая работа\n",
    "\n",
    "###Цели работы\n",
    "Закрепить на практике применение циклов for, while и использование команд break, continue, pass.\n",
    "\n",
    "###Что нужно сделать\n",
    "Скачайте файл с заданием, откройте его через Jupyter Notebook и выполните задачи.\n",
    "\n",
    "###Что оценивается\n",
    "Для каждой задачи:\n",
    "- программа выполняет все требуемые действия;\n",
    "- результаты вычислений и операций корректны;\n",
    "- вывод производится в том виде, который описан в задаче;\n",
    "- переменные названы информативно.\n",
    "\n",
    "### Как отправить работу на проверку\n",
    "Выполните задачи, сохраните изменения при помощи опции Save and Checkpoint из вкладки меню File или кнопки Save and Checkpoint на панели инструментов. Отправьте через форму ниже итоговый файл Jupyter Notebook .ipynb или ссылку на него.\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "r-2XwatHSvif"
   },
   "source": [
    "1. Напишите цикл, который выводит на печать все високосные годы начиная с 2020 года, но не позже 2050 года."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "id": "Zy0UG5ZwCx8Q"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2020\n",
      "2021\n",
      "2022\n",
      "2023\n",
      "2024\n",
      "2025\n",
      "2026\n",
      "2027\n",
      "2028\n",
      "2029\n",
      "2030\n",
      "2031\n",
      "2032\n",
      "2033\n",
      "2034\n",
      "2035\n",
      "2036\n",
      "2037\n",
      "2038\n",
      "2039\n",
      "2040\n",
      "2041\n",
      "2042\n",
      "2043\n",
      "2044\n",
      "2045\n",
      "2046\n",
      "2047\n",
      "2048\n",
      "2049\n",
      "2050\n"
     ]
    }
   ],
   "source": [
    "for year in range(2020, 2051):\n",
    "    print(year)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "grErwV6YS62m"
   },
   "source": [
    "2. Студент Джонсон поступил в университет и взял в кредит 120 тысяч долларов под 6% годовых. Все шесть лет учёбы в бакалавриате и магистратуре он не сможет выплачивать кредит, и процент будет прибавляться к основному кредиту. Напишите программу, которая посчитает, сколько студент Джонсон будет должен банку к концу своего обучения."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "id": "vyqbfM3sVp40"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "192000.0\n",
      "307200.0\n",
      "491520.0\n",
      "786432.0\n",
      "1258291.2000000002\n",
      "2013265.9200000004\n"
     ]
    }
   ],
   "source": [
    "# Начальная сумма\n",
    "loan = 120000\n",
    "for year in range(6):\n",
    "    loan *=1.6\n",
    "    print(loan)\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "-N68Ul6iXm6X"
   },
   "source": [
    "3. Вспомним задачу о [зёрнах на шахматной доске](https://ru.wikipedia.org/wiki/%D0%97%D0%B0%D0%B4%D0%B0%D1%87%D0%B0_%D0%BE_%D0%B7%D1%91%D1%80%D0%BD%D0%B0%D1%85_%D0%BD%D0%B0_%D1%88%D0%B0%D1%85%D0%BC%D0%B0%D1%82%D0%BD%D0%BE%D0%B9_%D0%B4%D0%BE%D1%81%D0%BA%D0%B5). На первую клетку кладётся одно зерно, на вторую — два зерна, на третью — четыре, затем — восемь. С каждой клеткой количество зёрен увеличивается в два раза.\n",
    "\n",
    "Напишите цикл, который выводил бы на печать порядковый номер клетки и количество зёрен на ней до тех пор, пока их количество на одной клетке не превысит 100 тысяч.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "ename": "SyntaxError",
     "evalue": "invalid syntax (3028230881.py, line 3)",
     "output_type": "error",
     "traceback": [
      "\u001b[1;36m  File \u001b[1;32m\"C:\\Users\\user\\AppData\\Local\\Temp\\ipykernel_10188\\3028230881.py\"\u001b[1;36m, line \u001b[1;32m3\u001b[0m\n\u001b[1;33m    third=4:\u001b[0m\n\u001b[1;37m           ^\u001b[0m\n\u001b[1;31mSyntaxError\u001b[0m\u001b[1;31m:\u001b[0m invalid syntax\n"
     ]
    }
   ],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "oSkgnq73b62i"
   },
   "source": [
    "4. Напишите программу, которая проверяла бы все числа от 0 до 30. Если число делится на два, его нужно напечатать. Но, если число делится и на четыре, его нужно пропустить."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {
    "id": "CYuIIxjOjwZd"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2\n",
      "6\n",
      "10\n",
      "14\n",
      "18\n",
      "22\n",
      "26\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "for i in range(0, 31):\n",
    "    if i % 2:\n",
    "        if i % 4:\n",
    "            pass\n",
    "        else:\n",
    "            pass\n",
    "    else:\n",
    "        if i % 4:\n",
    "            print(i)\n",
    "        else:\n",
    "            pass"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "VXoxvHZKjymf"
   },
   "source": [
    "5. Напишите программу, которая бесконечно запрашивает на ввод целое число и после каждого ввода печатает на экране ответ в соответствии со следующими условиями:\n",
    "  * Если введённое число делится на три, то печатается это же число.\n",
    "  * Если делится на пять, то на печать выводится его квадрат. Если же это число одновременно делится и на пять, и на три, то на экране должно появиться само число в соответствии с прошлым условием, а затем и его квадрат. То есть сначала должно отработать прошлое условие, а затем текущее. \n",
    "  * Если число делится на семь, нужно вывести на печать «дурак совсем» и прервать выполнение программы. \n",
    "  * Во всех остальных случаях программа должна снова запросить число на ввод.\n",
    "\n",
    "**Подсказка**\n",
    "\n",
    "Чтобы проверить, что программа работает верно, можно использовать следующие числа для теста: \n",
    "* 3 (в ответ печатается 3);\n",
    "* 5 (в ответ печатается 25);\n",
    "* 15 (в ответ печатается 15 и 225);\n",
    "* 1 (ничего не печатается, запрашивается следующее число на ввод);\n",
    "* 7 (в ответ печатается «дурак совсем», программа прерывается)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "id": "EEyux6ehlbI4"
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "colab": {
   "collapsed_sections": [],
   "provenance": []
  },
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 1
}
